TeenyRiotDevel/TeenyRiotAVR/avr/boards.txt

##############################################################

teenyriot-usbtiny.name=TeenyRiot (USBTiny)
teenyriot-usbtiny.upload.protocol=usbasp
teenyriot-usbtiny.upload.maximum_size=5375
teenyriot-usbtiny.upload.speed=19200
teenyriot-usbtiny.upload.disable_flushing=true
teenyriot-usbtiny.upload.tool=avrdude
teenyriot-usbtiny.bootloader.low_fuses=0xE1
teenyriot-usbtiny.bootloader.high_fuses=0x5D
teenyriot-usbtiny.bootloader.extended_fuses=0xFE
teenyriot-usbtiny.bootloader.file=teenyriot-usbtiny/teenyriot-usbtiny.hex
teenyriot-usbtiny.bootloader.tool=avrdude
teenyriot-usbtiny.build.mcu=attiny85
teenyriot-usbtiny.build.f_cpu=16500000L
teenyriot-usbtiny.build.core=teenyriot-core
teenyriot-usbtiny.build.variant=teenyriot
teenyriot-usbtiny.build.board=AVR_TEENYRIOT_USBTINY

##############################################################

teenyriot-micronucleus.name=TeenyRiot (Micronucleus)
teenyriot-micronucleus.upload.protocol=usb
teenyriot-micronucleus.upload.maximum_size=5375
teenyriot-micronucleus.upload.speed=19200
teenyriot-micronucleus.upload.disable_flushing=true
teenyriot-micronucleus.upload.tool=avrdude
teenyriot-micronucleus.bootloader.low_fuses=0xE1
teenyriot-micronucleus.bootloader.high_fuses=0x5D
teenyriot-micronucleus.bootloader.extended_fuses=0xFE
teenyriot-micronucleus.bootloader.file=teenyriot-micronucleus/teenyriot-micronucleus.hex
teenyriot-micronucleus.bootloader.tool=micronucleus
teenyriot-micronucleus.build.mcu=attiny85
teenyriot-micronucleus.build.f_cpu=16500000L
teenyriot-micronucleus.build.core=teenyriot-core
teenyriot-micronucleus.build.variant=teenyriot
teenyriot-micronucleus.build.board=AVR_TEENYRIOT_MICRONUCLEUS